<script setup>
import demo from "@/assets/flip-game.png"
</script>
<template>
    <h1>بازی پیدا کردن محصولات</h1>

    <p>
        قراره که یه بازی طراحی کنیم و به افرادی که بتونن در زمان مشخص همه تصاویر رو تطابق بدن جایزه‌ای اهدا کنیم.
    </p>

    <p>
        بازی اینطوری شروع میشه که با اولین کلیک روی هر کدوم از مربع‌ها تایمر شروع به‌ کار میکنه و یکی از تعداد
        حرکت‌ها کم میشه.
    </p>

    <p>
        با کلیک روی هر مربع، مربع از محور عمودی می‌چرخه و عکس پشت اون که یه محصول هست نمایش داده میشه.
        <br>
        با کلیک روی مربع بعدی، اون هم می‌چرخه و عکس پشت اون نمایش داده میشه.
        <br>
        اگر تصویر دو مربع یکی بود، هر دو ثابت می‌مانند. ولی اگر یکی نبود بعد از یک ثانیه هر دو مربع به حالت اول بر
        می‌گردند.
        <br>
        در هر صورت ۲ تا از تعداد حرکات باقی مونده کم میشه.
    </p>

    <p>
        اگر در زمان و تعداد حرکات مشخص شده همه مربع‌ها برگشتند و محصولات مشابه پیدا شدند، بازی با موفقیت به پایان
        می‌رسه. در غیر این صورت دکمه "شروع دوباره" نمایش داده میشه.
    </p>

    <p>
        تصاویر مورد نیاز بازی در پوشه assets آماده شده.
    </p>

    <h3>نکات</h3>
    <ul>
        <li>نسبت ابعاد تصاویر مربعی است.</li>
        <li>سعی کنین که مربع‌ها با انیمیشن بچرخند.</li>
        <li>مقادیر زمان و تعداد حرکت قابل تغییر هستند.</li>
        <li>در لود اولیه بازی و شروع دوباره، تصاویر به صورت رندم در مربع‌ها چیده می‌شوند.</li>
        <li>از هر گونه خلاقیت شما استقبال می‌شود.</li>
    </ul>

    <img :src="demo" alt="flip game">
</template>